# OffsetAlongWire Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricWireItem..::..OffsetAlongWire Property
FabricWireItem Class See Also
---
Offset along wire direction Wire distance should be 0 if we want to be along the same wire
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double OffsetAlongWire { get; set; }
```

Visual Basic
---
```text
Public Property OffsetAlongWire As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double OffsetAlongWire {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for offset is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for offset must be between 0 and 30000 feet. |

# See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace